---
sidebarDepth: 3
sidebar: auto
prev:
  text: Back To 目录
  link: /Redis/
typora-root-url: ..\.vuepress\public
---



::: tip

[Redis命令参考手册.pdf](https://gitee.com/q10viking/Books/blob/master/01-Redis%E5%91%BD%E4%BB%A4%E5%8F%82%E8%80%83%E6%89%8B%E5%86%8C%E5%AE%8C%E6%95%B4%E7%89%88.pdf)

:::



## **keys：全量遍历键**

用来列出所有满足特定正则字符串规则的key，当redis数据量比较大时，性能比较差，要避免使用

```
keys *
```



## **scan：渐进式遍历键**

scan 参数提供了三个参数，第一个是 cursor 整数值(hash桶的索引值)，第二个是 key 的正则模式，第三个是一次遍历的key的数量(参考值，底层遍历的数量不一定)，并不是符合条件的结果数量。第一次遍历时，cursor 值为 0，然后将返回结果中第一个整数值作为下一次遍历的 cursor。**一直遍历到返回的 cursor 值为 0 时结束**。

注意：但是scan并非完美无瑕， 如果在scan的过程中如果有键的变化（增加、 删除、 修改） ，那么遍历效果可能会碰到如下问题： 新增的键可能没有遍历到， 遍历出了重复的键等情况， 也就是说scan并不能保证完整的遍历出来所有的键， 这些是我们在开发时需要考虑的。

![](/images/Redis/80858.png)

![](/images/Redis/80856.png)

## **Info：查看redis服务运行信息**

>  **分为 9 大块，每个块都有非常多的参数，这 9 个块分别是:** 

```
Server 			服务器运行的环境参数 
Clients 		客户端相关信息 
Memory			服务器运行内存统计数据 
Persistence 	持久化信息 
Stats		    通用统计数据 
Replication 	主从复制相关信息 
CPU CPU		    使用情况 
Cluster 	    集群信息 
KeySpace 		键值对统计数量信息
```

```sh
connected_clients:2                  # 正在连接的客户端数量

instantaneous_ops_per_sec:789        # 每秒执行多少次指令

used_memory:929864                   # Redis分配的内存总量(byte)，包含redis进程内部的开销和数据占用的内存
used_memory_human:908.07K            # Redis分配的内存总量(Kb，human会展示出单位)
used_memory_rss_human:2.28M          # 向操作系统申请的内存大小(Mb)（这个值一般是大于used_memory的，因为Redis的内存分配策略会产生内存碎片）
used_memory_peak:929864              # redis的内存消耗峰值(byte)
used_memory_peak_human:908.07K       # redis的内存消耗峰值(KB)

maxmemory:0                         # 配置中设置的最大可使用内存值(byte),默认0,不限制
maxmemory_human:0B                  # 配置中设置的最大可使用内存值
maxmemory_policy:noeviction         # 当达到maxmemory时的淘汰策略
```



## 命令使用建议

1. 【推荐】 O(N)命令关注N的数量

   例如hgetall、lrange、smembers、zrange、sinter等并非不能使用，但是需要明确N的值。有遍历的需求可以使用hscan、sscan、zscan代替。

2. 【推荐】：禁用命令

   禁止线上使用keys、flushall、flushdb等，通过redis的rename机制禁掉命令，或者使用scan的方式渐进式处理。

3. 【推荐】合理使用select

   redis的多数据库较弱，使用数字进行区分，很多客户端支持较差，同时多业务用多数据库实际还是单线程处理，会有干扰。

   ```sh
   SELECT
   格式：select index 
   切换到指定的数据库，数据库索引号 index 用数字值指定，以 0 作为起始索引值。
   默认使用 0 号数据库。
   ```

   ```sh
   redis> SET db_number 0 # 默认使用 0 号数据库
   OK
   redis> SELECT 1 # 使用 1 号数据库
   OK
   redis[1]> GET db_number # 已经切换到 1 号数据库，注意 Redis 现在的
   命令提示符多了个 [1]
   (nil)
   redis[1]> SET db_number 1
   ```

   

4. 【推荐】使用批量操作提高效率

   ```sh
   原生命令：例如mget、mset。
   非原生命令：可以使用pipeline提高效率。
   ```

   但要注意控制一次批量操作的元素个数(例如500以内，实际也和元素字节数有关).注意两者不同：

   ```sh
   1. 原生命令是原子操作，pipeline是非原子操作。
   2. pipeline可以打包不同的命令，原生命令做不到
   3. pipeline需要客户端和服务端同时支持。
   ```

5. 【建议】Redis事务功能较弱，不建议过多使用，❤️可以用lua替代❤️

